cf/DataProcessors/InteractiveExportChange.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>InteractiveExportChange</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ExportVariant</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AllDocumentsFilterPeriod</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AddressLinkerAllDocuments</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NodeScriptFilterPeriod</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AdditionalRegistrationScriptSite</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NodeScriptFilterPresentation</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ScriptParametersAdditions</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ViewCurrentSettings</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InfobaseNode</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ComposerAllDocumentsFilter</Name>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AdditionalRegistration</Name>
					<Comment>Additional registration table</Comment>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AddressOfFormStore</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cf/Enums/ExchangeObjectsExportModes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ExchangeObjectsExportModes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>AlwaysExport</Name>
					<Comment>Export without of applying filters</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ExportByCondition</Name>
					<Comment>Export with filters applying</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ExportIfNecessary</Name>
					<Comment>Export without of applying filters, but with referential integrity control of exporting data</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ExportManually</Name>
					<Comment>In this modes changes are not registered automatically (through event subscriptions); objects are registering for export manually by user and export only if match to filter, set at the node, for which export is performing</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DoNotExport</Name>
					<Comment>In this modes changes are not registered automatically (through event subscriptions) and not exporting, even if changes of objects were registered manually by user.</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/DataProcessors/InteractiveExportChange/Forms/CaseTypeObjectCompositionNode/Ext/Form/Module.bsl
#Region FormEventsHandlers

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	If Parameters.Property("AutoTest") Then // Return if the form for analysis is received.
		Return;
	EndIf;
	
	CloseOnOwnerClose = True;
	CloseOnChoice = False;
	
	Object.InfobaseNode = Parameters.InfobaseNode;
	
	TreeSelect = FormAttributeToValue("AvailableObjectKinds");
	SelectionTreeRows = TreeSelect.Rows;
	SelectionTreeRows.Clear();
	
	AllData = DataExchangeReUse.ExchangePlanContent(Object.InfobaseNode.Metadata().Name);

	// Hide objects, for which it is specified "DoNotExport".
	DoNotExportMode = Enums.ExchangeObjectsExportModes.DoNotExport;
	ImportMode   = DataExchangeReUse.UserExchangePlanContent(Object.InfobaseNode);
	Position = AllData.Count() - 1;
	While Position >= 0 Do
		DataRow = AllData[Position];
		If ImportMode[DataRow.FullMetadataName] = DoNotExportMode Then
			AllData.Delete(Position);
		EndIf;
		Position = Position - 1;
	EndDo;
	
	// Delete standard metadata image for leaves.
	AllData.FillValues(-1, "PictureIndex");
	
	AddAllObjects(AllData, SelectionTreeRows);
	
	ValueToFormAttribute(TreeSelect, "AvailableObjectKinds");
	
	SelectedColumns = "";
	For Each Attribute IN GetAttributes("AvailableObjectKinds") Do
		SelectedColumns = SelectedColumns + "," + Attribute.Name;
	EndDo;
	SelectedColumns = Mid(SelectedColumns, 2);
	
EndProcedure

#EndRegion

#Region FormTableItemEventHandlersAvailableObjectKinds

&AtClient
Procedure AvailableKindsObjectsCase(Item, SelectedRow, Field, StandardProcessing)
	ExecuteCase(SelectedRow);
EndProcedure

#EndRegion

#Region FormCommandsHandlers

&AtClient
Procedure PickAndClose(Command)
	ExecuteCase();
	Close();
EndProcedure

&AtClient
Procedure Pick(Command)
	ExecuteCase();
EndProcedure

#EndRegion

#Region ServiceProceduresAndFunctions

&AtServer
Function ThisObject(NewObject = Undefined)
	If NewObject=Undefined Then
		Return FormAttributeToValue("Object");
	EndIf;
	ValueToFormAttribute(NewObject, "Object");
	Return Undefined;
EndFunction

&AtClient
Procedure ExecuteCase(SelectedRow = Undefined)
	
	FormTable = Items.AvailableObjectKinds;
	ChoiceData = New Array;
	
	If SelectedRow = Undefined Then
		For Each String IN FormTable.SelectedRows Do
			ChoiceItem = New Structure(SelectedColumns);
			FillPropertyValues(ChoiceItem, FormTable.RowData(String) );
			ChoiceData.Add(ChoiceItem);
		EndDo;
		
	ElsIf TypeOf(SelectedRow) = Type("Array") Then
		For Each String IN SelectedRow Do
			ChoiceItem = New Structure(SelectedColumns);
			FillPropertyValues(ChoiceItem, FormTable.RowData(String) );
			ChoiceData.Add(ChoiceItem);
		EndDo;
		
	Else
		ChoiceItem = New Structure(SelectedColumns);
		FillPropertyValues(ChoiceItem, FormTable.RowData(SelectedRow) );
		ChoiceData.Add(ChoiceItem);
	EndIf;
	
	NotifyChoice(ChoiceData);
EndProcedure

&AtServer
Procedure AddAllObjects(AllReferenceDataNode, TargetRows)
	
	ThisDataProcessor = ThisObject();
	
	DocumentsGroup = TargetRows.Add();
	DocumentsGroup.ListPresentation = ThisDataProcessor.AllDocumentsFilterTitleGroup();
	DocumentsGroup.FullMetadataName = ThisDataProcessor.AllDocumentsID();
	DocumentsGroup.PictureIndex = 7;
	
	CatalogsGroup = TargetRows.Add();
	CatalogsGroup.ListPresentation = ThisDataProcessor.AllCatalogsFilterGroupsTitle();
	CatalogsGroup.FullMetadataName = ThisDataProcessor.AllCatalogsID();
	CatalogsGroup.PictureIndex = 3;
	
	For Each String IN AllReferenceDataNode Do
		If String.PeriodSelection Then
			FillPropertyValues(DocumentsGroup.Rows.Add(), String);
		Else
			FillPropertyValues(CatalogsGroup.Rows.Add(), String);
		EndIf;
	EndDo;
	
	// Delete empty
	If DocumentsGroup.Rows.Count() = 0 Then
		TargetRows.Delete(DocumentsGroup);
	EndIf;
	If CatalogsGroup.Rows.Count() = 0 Then
		TargetRows.Delete(CatalogsGroup);
	EndIf;
	
EndProcedure

#EndRegion
